SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG23/Include/efr32fg23_modem.h
/* Bit fields for MODEM CTRL6 */
#define _MODEM_CTRL6_RESETVALUE                                 0x00000000UL                                   /**< Default value for MODEM_CTRL6               */
#define _MODEM_CTRL6_MASK                                       0xF6FFFFFFUL                                   /**< Mask for MODEM_CTRL6                        */
#define _MODEM_CTRL6_TDREW_SHIFT                                0                                              /**< Shift value for MODEM_TDREW                 */
#define _MODEM_CTRL6_TDREW_MASK                                 0x7FUL                                         /**< Bit mask for MODEM_TDREW                    */
#define _MODEM_CTRL6_TDREW_DEFAULT                              0x00000000UL                                   /**< Mode DEFAULT for MODEM_CTRL6                */
#define MODEM_CTRL6_TDREW_DEFAULT                               (_MODEM_CTRL6_TDREW_DEFAULT << 0)              /**< Shifted mode DEFAULT for MODEM_CTRL6        */
#define _MODEM_CTRL6_PREBASES_SHIFT                             7                                              /**< Shift value for MODEM_PREBASES              */
#define _MODEM_CTRL6_PREBASES_MASK                              0x780UL                                        /**< Bit mask for MODEM_PREBASES                 */
#define _MODEM_CTRL6_PREBASES_DEFAULT                           0x00000000UL                                   /**< Mode DEFAULT for MODEM_CTRL6                */
#define MODEM_CTRL6_PREBASES_DEFAULT                            (_MODEM_CTRL6_PREBASES_DEFAULT << 7)           /**< Shifted mode DEFAULT for MODEM_CTRL6        */
#define MODEM_CTRL6_PSTIMABORT0                                 (0x1UL << 11)                                  /**< Preamble Search Timing Abort Criteria 0     */
#define _MODEM_CTRL6_PSTIMABORT0_SHIFT                          11                                             /**< Shift value for MODEM_PSTIMABORT0           */
#define _MODEM_CTRL6_PSTIMABORT0_MASK                           0x800UL                                        /**< Bit mask for MODEM_PSTIMABORT0              */
#define _MODEM_CTRL6_PSTIMABORT0_DEFAULT                        0x00000000UL                                   /**< Mode DEFAULT for MODEM_CTRL6                */
#define MODEM_CTRL6_PSTIMABORT0_DEFAULT                         (_MODEM_CTRL6_PSTIMABORT0_DEFAULT << 11)       /**< Shifted mode DEFAULT for MODEM_CTRL6        */
#define MODEM_CTRL6_PSTIMABORT1                                 (0x1UL << 12)                                  /**< Preamble Search Timing Abort Criteria 1     */
#define _MODEM_CTRL6_PSTIMABORT1_SHIFT                          12                                             /**< Shift value for MODEM_PSTIMABORT1           */
#define _MODEM_CTRL6_PSTIMABORT1_MASK                           0x1000UL                                       /**< Bit mask for MODEM_PSTIMABORT1              */
#define _MODEM_CTRL6_PSTIMABORT1_DEFAULT                        0x00000000UL                                   /**< Mode DEFAULT for MODEM_CTRL6                */
#define MODEM_CTRL6_PSTIMABORT1_DEFAULT                         (_MODEM_CTRL6_PSTIMABORT1_DEFAULT << 12)       /**< Shifted mode DEFAULT for MODEM_CTRL6        */
#define MODEM_CTRL6_PSTIMABORT2                                 (0x1UL << 13)                                  /**< Preamble Search Timing Abort Criteria 2     */
#define _MODEM_CTRL6_PSTIMABORT2_SHIFT                          13                                             /**< Shift value for MODEM_PSTIMABORT2           */
#define _MODEM_CTRL6_PSTIMABORT2_MASK                           0x2000UL                                       /**< Bit mask for MODEM_PSTIMABORT2              */
#define _MODEM_CTRL6_PSTIMABORT2_DEFAULT                        0x00000000UL                                   /**< Mode DEFAULT for MODEM_CTRL6                */
#define MODEM_CTRL6_PSTIMABORT2_DEFAULT                         (_MODEM_CTRL6_PSTIMABORT2_DEFAULT << 13)       /**< Shifted mode DEFAULT for MODEM_CTRL6        */
#define MODEM_CTRL6_PSTIMABORT3                                 (0x1UL << 14)                                  /**< Preamble Search Timing Abort Criteria 3     */
#define _MODEM_CTRL6_PSTIMABORT3_SHIFT                          14                                             /**< Shift value for MODEM_PSTIMABORT3           */
#define _MODEM_CTRL6_PSTIMABORT3_MASK                           0x4000UL                                       /**< Bit mask for MODEM_PSTIMABORT3              */
#define _MODEM_CTRL6_PSTIMABORT3_DEFAULT                        0x00000000UL                                   /**< Mode DEFAULT for MODEM_CTRL6                */
#define MODEM_CTRL6_PSTIMABORT3_DEFAULT                         (_MODEM_CTRL6_PSTIMABORT3_DEFAULT << 14)       /**< Shifted mode DEFAULT for MODEM_CTRL6        */
#define _MODEM_CTRL6_ARW_SHIFT                                  15                                             /**< Shift value for MODEM_ARW                   */
#define _MODEM_CTRL6_ARW_MASK                                   0x18000UL                                      /**< Bit mask for MODEM_ARW                      */
#define _MODEM_CTRL6_ARW_DEFAULT                                0x00000000UL                                   /**< Mode DEFAULT for MODEM_CTRL6                */
#define _MODEM_CTRL6_ARW_SMALLWND                               0x00000000UL                                   /**< Mode SMALLWND for MODEM_CTRL6               */
#define _MODEM_CTRL6_ARW_ALWAYS                                 0x00000001UL                                   /**< Mode ALWAYS for MODEM_CTRL6                 */
#define _MODEM_CTRL6_ARW_NEVER                                  0x00000002UL                                   /**< Mode NEVER for MODEM_CTRL6                  */
#define _MODEM_CTRL6_ARW_PSABORT                                0x00000003UL                                   /**< Mode PSABORT for MODEM_CTRL6                */
#define MODEM_CTRL6_ARW_DEFAULT                                 (_MODEM_CTRL6_ARW_DEFAULT << 15)               /**< Shifted mode DEFAULT for MODEM_CTRL6        */
#define MODEM_CTRL6_ARW_SMALLWND                                (_MODEM_CTRL6_ARW_SMALLWND << 15)              /**< Shifted mode SMALLWND for MODEM_CTRL6       */
#define MODEM_CTRL6_ARW_ALWAYS                                  (_MODEM_CTRL6_ARW_ALWAYS << 15)                /**< Shifted mode ALWAYS for MODEM_CTRL6         */
#define MODEM_CTRL6_ARW_NEVER                                   (_MODEM_CTRL6_ARW_NEVER << 15)                 /**< Shifted mode NEVER for MODEM_CTRL6          */
#define MODEM_CTRL6_ARW_PSABORT                                 (_MODEM_CTRL6_ARW_PSABORT << 15)               /**< Shifted mode PSABORT for MODEM_CTRL6        */
#define _MODEM_CTRL6_TIMTHRESHGAIN_SHIFT                        17                                             /**< Shift value for MODEM_TIMTHRESHGAIN         */
#define _MODEM_CTRL6_TIMTHRESHGAIN_MASK                         0xE0000UL                                      /**< Bit mask for MODEM_TIMTHRESHGAIN            */
#define _MODEM_CTRL6_TIMTHRESHGAIN_DEFAULT                      0x00000000UL                                   /**< Mode DEFAULT for MODEM_CTRL6                */
#define MODEM_CTRL6_TIMTHRESHGAIN_DEFAULT                       (_MODEM_CTRL6_TIMTHRESHGAIN_DEFAULT << 17)     /**< Shifted mode DEFAULT for MODEM_CTRL6        */
#define MODEM_CTRL6_CPLXCORREN                                  (0x1UL << 20)                                  /**< Enable Complex Correlation                  */
#define _MODEM_CTRL6_CPLXCORREN_SHIFT                           20                                             /**< Shift value for MODEM_CPLXCORREN            */
#define _MODEM_CTRL6_CPLXCORREN_MASK                            0x100000UL                                     /**< Bit mask for MODEM_CPLXCORREN               */
#define _MODEM_CTRL6_CPLXCORREN_DEFAULT                         0x00000000UL                                   /**< Mode DEFAULT for MODEM_CTRL6                */
#define MODEM_CTRL6_CPLXCORREN_DEFAULT                          (_MODEM_CTRL6_CPLXCORREN_DEFAULT << 20)        /**< Shifted mode DEFAULT for MODEM_CTRL6        */
#define MODEM_CTRL6_DSSS3SYMBOLSYNCEN                           (0x1UL << 21)                                  /**< Enable three symbol sync detection          */
#define _MODEM_CTRL6_DSSS3SYMBOLSYNCEN_SHIFT                    21                                             /**< Shift value for MODEM_DSSS3SYMBOLSYNCEN     */
#define _MODEM_CTRL6_DSSS3SYMBOLSYNCEN_MASK                     0x200000UL                                     /**< Bit mask for MODEM_DSSS3SYMBOLSYNCEN        */
#define _MODEM_CTRL6_DSSS3SYMBOLSYNCEN_DEFAULT                  0x00000000UL                                   /**< Mode DEFAULT for MODEM_CTRL6                */
#define MODEM_CTRL6_DSSS3SYMBOLSYNCEN_DEFAULT                   (_MODEM_CTRL6_DSSS3SYMBOLSYNCEN_DEFAULT << 21) /**< Shifted mode DEFAULT for MODEM_CTRL6        */
#define MODEM_CTRL6_TXDBPSKINV                                  (0x1UL << 22)                                  /**< TX DBPSK modulation encode invert           */
#define _MODEM_CTRL6_TXDBPSKINV_SHIFT                           22                                             /**< Shift value for MODEM_TXDBPSKINV            */
#define _MODEM_CTRL6_TXDBPSKINV_MASK                            0x400000UL                                     /**< Bit mask for MODEM_TXDBPSKINV               */
#define _MODEM_CTRL6_TXDBPSKINV_DEFAULT                         0x00000000UL                                   /**< Mode DEFAULT for MODEM_CTRL6                */
#define MODEM_CTRL6_TXDBPSKINV_DEFAULT                          (_MODEM_CTRL6_TXDBPSKINV_DEFAULT << 22)        /**< Shifted mode DEFAULT for MODEM_CTRL6        */
#define MODEM_CTRL6_TXDBPSKRAMPEN                               (0x1UL << 23)                                  /**< TX DBPSK PA Ramp Enable                     */
#define _MODEM_CTRL6_TXDBPSKRAMPEN_SHIFT                        23                                             /**< Shift value for MODEM_TXDBPSKRAMPEN         */
#define _MODEM_CTRL6_TXDBPSKRAMPEN_MASK                         0x800000UL                                     /**< Bit mask for MODEM_TXDBPSKRAMPEN            */
#define _MODEM_CTRL6_TXDBPSKRAMPEN_DEFAULT                      0x00000000UL                                   /**< Mode DEFAULT for MODEM_CTRL6                */
#define MODEM_CTRL6_TXDBPSKRAMPEN_DEFAULT                       (_MODEM_CTRL6_TXDBPSKRAMPEN_DEFAULT << 23)     /**< Shifted mode DEFAULT for MODEM_CTRL6        */
#define _MODEM_CTRL6_CODINGB_SHIFT                              25                                             /**< Shift value for MODEM_CODINGB               */
#define _MODEM_CTRL6_CODINGB_MASK                               0x6000000UL                                    /**< Bit mask for MODEM_CODINGB                  */
#define _MODEM_CTRL6_CODINGB_DEFAULT                            0x00000000UL                                   /**< Mode DEFAULT for MODEM_CTRL6                */
#define _MODEM_CTRL6_CODINGB_NRZ                                0x00000000UL                                   /**< Mode NRZ for MODEM_CTRL6                    */
#define _MODEM_CTRL6_CODINGB_MANCHESTER                         0x00000001UL                                   /**< Mode MANCHESTER for MODEM_CTRL6             */
#define _MODEM_CTRL6_CODINGB_DSSS                               0x00000002UL                                   /**< Mode DSSS for MODEM_CTRL6                   */
#define _MODEM_CTRL6_CODINGB_LINECODE                           0x00000003UL                                   /**< Mode LINECODE for MODEM_CTRL6               */
#define MODEM_CTRL6_CODINGB_DEFAULT                             (_MODEM_CTRL6_CODINGB_DEFAULT << 25)           /**< Shifted mode DEFAULT for MODEM_CTRL6        */
#define MODEM_CTRL6_CODINGB_NRZ                                 (_MODEM_CTRL6_CODINGB_NRZ << 25)               /**< Shifted mode NRZ for MODEM_CTRL6            */
#define MODEM_CTRL6_CODINGB_MANCHESTER                          (_MODEM_CTRL6_CODINGB_MANCHESTER << 25)        /**< Shifted mode MANCHESTER for MODEM_CTRL6     */
#define MODEM_CTRL6_CODINGB_DSSS                                (_MODEM_CTRL6_CODINGB_DSSS << 25)              /**< Shifted mode DSSS for MODEM_CTRL6           */
#define MODEM_CTRL6_CODINGB_LINECODE                            (_MODEM_CTRL6_CODINGB_LINECODE << 25)          /**< Shifted mode LINECODE for MODEM_CTRL6       */
#define MODEM_CTRL6_RXBRCALCDIS                                 (0x1UL << 30)                                  /**< RX Baudrate Calculation Disable             */
#define _MODEM_CTRL6_RXBRCALCDIS_SHIFT                          30                                             /**< Shift value for MODEM_RXBRCALCDIS           */
#define _MODEM_CTRL6_RXBRCALCDIS_MASK                           0x40000000UL                                   /**< Bit mask for MODEM_RXBRCALCDIS              */
#define _MODEM_CTRL6_RXBRCALCDIS_DEFAULT                        0x00000000UL                                   /**< Mode DEFAULT for MODEM_CTRL6                */
#define MODEM_CTRL6_RXBRCALCDIS_DEFAULT                         (_MODEM_CTRL6_RXBRCALCDIS_DEFAULT << 30)       /**< Shifted mode DEFAULT for MODEM_CTRL6        */

/* Bit fields for MODEM TXBR */
#define _MODEM_TXBR_RESETVALUE                                  0x00000000UL                        /**< Default value for MODEM_TXBR                */
#define _MODEM_TXBR_MASK                                        0x00FFFFFFUL                        /**< Mask for MODEM_TXBR                         */
#define _MODEM_TXBR_TXBRNUM_SHIFT                               0                                   /**< Shift value for MODEM_TXBRNUM               */
#define _MODEM_TXBR_TXBRNUM_MASK                                0xFFFFUL                            /**< Bit mask for MODEM_TXBRNUM                  */
#define _MODEM_TXBR_TXBRNUM_DEFAULT                             0x00000000UL                        /**< Mode DEFAULT for MODEM_TXBR                 */
#define MODEM_TXBR_TXBRNUM_DEFAULT                              (_MODEM_TXBR_TXBRNUM_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_TXBR         */
#define _MODEM_TXBR_TXBRDEN_SHIFT                               16                                  /**< Shift value for MODEM_TXBRDEN               */
#define _MODEM_TXBR_TXBRDEN_MASK                                0xFF0000UL                          /**< Bit mask for MODEM_TXBRDEN                  */
#define _MODEM_TXBR_TXBRDEN_DEFAULT                             0x00000000UL                        /**< Mode DEFAULT for MODEM_TXBR                 */
#define MODEM_TXBR_TXBRDEN_DEFAULT                              (_MODEM_TXBR_TXBRDEN_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_TXBR         */

