SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG23/Include/efr32fg23_modem.h
/* Bit fields for MODEM ANARAMP3 */
#define _MODEM_ANARAMP3_RESETVALUE                              0x06210821UL                                 /**< Default value for MODEM_ANARAMP3            */
#define _MODEM_ANARAMP3_MASK                                    0x3FFFFFFFUL                                 /**< Mask for MODEM_ANARAMP3                     */
#define _MODEM_ANARAMP3_ANARAMPLUT18_SHIFT                      0                                            /**< Shift value for MODEM_ANARAMPLUT18          */
#define _MODEM_ANARAMP3_ANARAMPLUT18_MASK                       0x1FUL                                       /**< Bit mask for MODEM_ANARAMPLUT18             */
#define _MODEM_ANARAMP3_ANARAMPLUT18_DEFAULT                    0x00000001UL                                 /**< Mode DEFAULT for MODEM_ANARAMP3             */
#define MODEM_ANARAMP3_ANARAMPLUT18_DEFAULT                     (_MODEM_ANARAMP3_ANARAMPLUT18_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ANARAMP3     */
#define _MODEM_ANARAMP3_ANARAMPLUT19_SHIFT                      5                                            /**< Shift value for MODEM_ANARAMPLUT19          */
#define _MODEM_ANARAMP3_ANARAMPLUT19_MASK                       0x3E0UL                                      /**< Bit mask for MODEM_ANARAMPLUT19             */
#define _MODEM_ANARAMP3_ANARAMPLUT19_DEFAULT                    0x00000001UL                                 /**< Mode DEFAULT for MODEM_ANARAMP3             */
#define MODEM_ANARAMP3_ANARAMPLUT19_DEFAULT                     (_MODEM_ANARAMP3_ANARAMPLUT19_DEFAULT << 5)  /**< Shifted mode DEFAULT for MODEM_ANARAMP3     */
#define _MODEM_ANARAMP3_ANARAMPLUT20_SHIFT                      10                                           /**< Shift value for MODEM_ANARAMPLUT20          */
#define _MODEM_ANARAMP3_ANARAMPLUT20_MASK                       0x7C00UL                                     /**< Bit mask for MODEM_ANARAMPLUT20             */
#define _MODEM_ANARAMP3_ANARAMPLUT20_DEFAULT                    0x00000002UL                                 /**< Mode DEFAULT for MODEM_ANARAMP3             */
#define MODEM_ANARAMP3_ANARAMPLUT20_DEFAULT                     (_MODEM_ANARAMP3_ANARAMPLUT20_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_ANARAMP3     */
#define _MODEM_ANARAMP3_ANARAMPLUT21_SHIFT                      15                                           /**< Shift value for MODEM_ANARAMPLUT21          */
#define _MODEM_ANARAMP3_ANARAMPLUT21_MASK                       0xF8000UL                                    /**< Bit mask for MODEM_ANARAMPLUT21             */
#define _MODEM_ANARAMP3_ANARAMPLUT21_DEFAULT                    0x00000002UL                                 /**< Mode DEFAULT for MODEM_ANARAMP3             */
#define MODEM_ANARAMP3_ANARAMPLUT21_DEFAULT                     (_MODEM_ANARAMP3_ANARAMPLUT21_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_ANARAMP3     */
#define _MODEM_ANARAMP3_ANARAMPLUT22_SHIFT                      20                                           /**< Shift value for MODEM_ANARAMPLUT22          */
#define _MODEM_ANARAMP3_ANARAMPLUT22_MASK                       0x1F00000UL                                  /**< Bit mask for MODEM_ANARAMPLUT22             */
#define _MODEM_ANARAMP3_ANARAMPLUT22_DEFAULT                    0x00000002UL                                 /**< Mode DEFAULT for MODEM_ANARAMP3             */
#define MODEM_ANARAMP3_ANARAMPLUT22_DEFAULT                     (_MODEM_ANARAMP3_ANARAMPLUT22_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_ANARAMP3     */
#define _MODEM_ANARAMP3_ANARAMPLUT23_SHIFT                      25                                           /**< Shift value for MODEM_ANARAMPLUT23          */
#define _MODEM_ANARAMP3_ANARAMPLUT23_MASK                       0x3E000000UL                                 /**< Bit mask for MODEM_ANARAMPLUT23             */
#define _MODEM_ANARAMP3_ANARAMPLUT23_DEFAULT                    0x00000003UL                                 /**< Mode DEFAULT for MODEM_ANARAMP3             */
#define MODEM_ANARAMP3_ANARAMPLUT23_DEFAULT                     (_MODEM_ANARAMP3_ANARAMPLUT23_DEFAULT << 25) /**< Shifted mode DEFAULT for MODEM_ANARAMP3     */

/* Bit fields for MODEM ANARAMP4 */
#define _MODEM_ANARAMP4_RESETVALUE                              0x08420C63UL                                 /**< Default value for MODEM_ANARAMP4            */
#define _MODEM_ANARAMP4_MASK                                    0x3FFFFFFFUL                                 /**< Mask for MODEM_ANARAMP4                     */
#define _MODEM_ANARAMP4_ANARAMPLUT24_SHIFT                      0                                            /**< Shift value for MODEM_ANARAMPLUT24          */
#define _MODEM_ANARAMP4_ANARAMPLUT24_MASK                       0x1FUL                                       /**< Bit mask for MODEM_ANARAMPLUT24             */
#define _MODEM_ANARAMP4_ANARAMPLUT24_DEFAULT                    0x00000003UL                                 /**< Mode DEFAULT for MODEM_ANARAMP4             */
#define MODEM_ANARAMP4_ANARAMPLUT24_DEFAULT                     (_MODEM_ANARAMP4_ANARAMPLUT24_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ANARAMP4     */
#define _MODEM_ANARAMP4_ANARAMPLUT25_SHIFT                      5                                            /**< Shift value for MODEM_ANARAMPLUT25          */
#define _MODEM_ANARAMP4_ANARAMPLUT25_MASK                       0x3E0UL                                      /**< Bit mask for MODEM_ANARAMPLUT25             */
#define _MODEM_ANARAMP4_ANARAMPLUT25_DEFAULT                    0x00000003UL                                 /**< Mode DEFAULT for MODEM_ANARAMP4             */
#define MODEM_ANARAMP4_ANARAMPLUT25_DEFAULT                     (_MODEM_ANARAMP4_ANARAMPLUT25_DEFAULT << 5)  /**< Shifted mode DEFAULT for MODEM_ANARAMP4     */
#define _MODEM_ANARAMP4_ANARAMPLUT26_SHIFT                      10                                           /**< Shift value for MODEM_ANARAMPLUT26          */
#define _MODEM_ANARAMP4_ANARAMPLUT26_MASK                       0x7C00UL                                     /**< Bit mask for MODEM_ANARAMPLUT26             */
#define _MODEM_ANARAMP4_ANARAMPLUT26_DEFAULT                    0x00000003UL                                 /**< Mode DEFAULT for MODEM_ANARAMP4             */
#define MODEM_ANARAMP4_ANARAMPLUT26_DEFAULT                     (_MODEM_ANARAMP4_ANARAMPLUT26_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_ANARAMP4     */
#define _MODEM_ANARAMP4_ANARAMPLUT27_SHIFT                      15                                           /**< Shift value for MODEM_ANARAMPLUT27          */
#define _MODEM_ANARAMP4_ANARAMPLUT27_MASK                       0xF8000UL                                    /**< Bit mask for MODEM_ANARAMPLUT27             */
#define _MODEM_ANARAMP4_ANARAMPLUT27_DEFAULT                    0x00000004UL                                 /**< Mode DEFAULT for MODEM_ANARAMP4             */
#define MODEM_ANARAMP4_ANARAMPLUT27_DEFAULT                     (_MODEM_ANARAMP4_ANARAMPLUT27_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_ANARAMP4     */
#define _MODEM_ANARAMP4_ANARAMPLUT28_SHIFT                      20                                           /**< Shift value for MODEM_ANARAMPLUT28          */
#define _MODEM_ANARAMP4_ANARAMPLUT28_MASK                       0x1F00000UL                                  /**< Bit mask for MODEM_ANARAMPLUT28             */
#define _MODEM_ANARAMP4_ANARAMPLUT28_DEFAULT                    0x00000004UL                                 /**< Mode DEFAULT for MODEM_ANARAMP4             */
#define MODEM_ANARAMP4_ANARAMPLUT28_DEFAULT                     (_MODEM_ANARAMP4_ANARAMPLUT28_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_ANARAMP4     */
#define _MODEM_ANARAMP4_ANARAMPLUT29_SHIFT                      25                                           /**< Shift value for MODEM_ANARAMPLUT29          */
#define _MODEM_ANARAMP4_ANARAMPLUT29_MASK                       0x3E000000UL                                 /**< Bit mask for MODEM_ANARAMPLUT29             */
#define _MODEM_ANARAMP4_ANARAMPLUT29_DEFAULT                    0x00000004UL                                 /**< Mode DEFAULT for MODEM_ANARAMP4             */
#define MODEM_ANARAMP4_ANARAMPLUT29_DEFAULT                     (_MODEM_ANARAMP4_ANARAMPLUT29_DEFAULT << 25) /**< Shifted mode DEFAULT for MODEM_ANARAMP4     */

